scripts/cfd/mof_harvester/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Simplified MOF Water Harvester Geometry
// 2D rectangular cavity (first pass for validation)
// - Hot sorbent at bottom (373 K / 100°C)
// - Cool dome at top (303 K / 30°C)
// - Insulated sides
// Dimensions based on MIT device: 0.3m x 0.3m

scale   1;

vertices
(
    // Back face (z = 0)
    (0 0 0)        // 0 - bottom left
    (0.3 0 0)      // 1 - bottom right
    (0.3 0.3 0)    // 2 - top right
    (0 0.3 0)      // 3 - top left

    // Front face (z = 0.01) - thin for 2D
    (0 0 0.01)     // 4
    (0.3 0 0.01)   // 5
    (0.3 0.3 0.01) // 6
    (0 0.3 0.01)   // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 60 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sorbent
    {
        type wall;
        faces
        (
            (0 1 5 4)  // Bottom - hot sorbent surface
        );
    }

    dome
    {
        type wall;
        faces
        (
            (3 7 6 2)  // Top - cool dome/condenser
        );
    }

    sides
    {
        type wall;
        faces
        (
            (0 4 7 3)  // Left side - insulated
            (1 2 6 5)  // Right side - insulated
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)  // Back
            (4 5 6 7)  // Front
        );
    }
);

// ************************************************************************* //
